In [3]:
import pandas as pd

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [5]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [7]:
#column의 순서를 변경
pd.DataFrame(data, columns =['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [9]:
import pandas as pd
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [ ]:
###행 인덱스 / 열 이름 변경

In [14]:
frame2.rename(columns={'year':'YEA','state':'STA','pop':'POP','debt':'DEB'}, inplace=True)
frame2.head()

        YEA     STA  POP  DEB
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [15]:
frame2.rename(columns={'year':'YEA','state':'STA','pop':'POP','debt':'DEB'}, inplace=True)
frame2.head()
frame2.rename(index={'one':'01','two':'02','three':'03','four':'04'}, inplace=True)
frame2.head()

       YEA     STA  POP  DEB
01    2000    Ohio  1.5  NaN
02    2001    Ohio  1.7  NaN
03    2002    Ohio  3.6  NaN
04    2001  Nevada  2.4  NaN
five  2002  Nevada  2.9  NaN

In [16]:
frame2['STA']

01        Ohio
02        Ohio
03        Ohio
04      Nevada
five    Nevada
six     Nevada
Name: STA, dtype: object

In [18]:
frame2.YEA

01      2000
02      2001
03      2002
04      2001
five    2002
six     2003
Name: YEA, dtype: int64

In [20]:
frame2.loc['03']

YEA    2002
STA    Ohio
POP     3.6
DEB     NaN
Name: 03, dtype: object

In [21]:
frame2.iloc[2]

YEA    2002
STA    Ohio
POP     3.6
DEB     NaN
Name: 03, dtype: object

In [24]:
frame2['DEB'] =16.5
frame2

       YEA     STA  POP   DEB
01    2000    Ohio  1.5  16.5
02    2001    Ohio  1.7  16.5
03    2002    Ohio  3.6  16.5
04    2001  Nevada  2.4  16.5
five  2002  Nevada  2.9  16.5
six   2003  Nevada  3.2  16.5

In [26]:
import numpy as np
frame2['DEB'] =np.arange(6.)
frame2

       YEA     STA  POP  DEB
01    2000    Ohio  1.5  0.0
02    2001    Ohio  1.7  1.0
03    2002    Ohio  3.6  2.0
04    2001  Nevada  2.4  3.0
five  2002  Nevada  2.9  4.0
six   2003  Nevada  3.2  5.0

In [27]:
import numpy as np
frame2['DEB'] =np.arange(1,13,2)
frame2

       YEA     STA  POP  DEB
01    2000    Ohio  1.5    1
02    2001    Ohio  1.7    3
03    2002    Ohio  3.6    5
04    2001  Nevada  2.4    7
five  2002  Nevada  2.9    9
six   2003  Nevada  3.2   11

In [29]:
val = pd.Series([-1.2,-1.5,-1.7],index=['02','04','six'])
frame2['DEB'] = val

frame2

       YEA     STA  POP  DEB
01    2000    Ohio  1.5  NaN
02    2001    Ohio  1.7 -1.2
03    2002    Ohio  3.6  NaN
04    2001  Nevada  2.4 -1.5
five  2002  Nevada  2.9  NaN
six   2003  Nevada  3.2 -1.7

In [35]:
#새로운 열 생성
frame2['eastern'] = frame2.STA == 'Ohio'
frame2

       YEA     STA  POP  DEB  eastern
01    2000    Ohio  1.5  NaN     True
02    2001    Ohio  1.7 -1.2     True
03    2002    Ohio  3.6  NaN     True
04    2001  Nevada  2.4 -1.5    False
five  2002  Nevada  2.9  NaN    False
six   2003  Nevada  3.2 -1.7    False

In [36]:
frame2['Big state'] = (frame2.STA == 'Ohio') & (frame2.POP > 3.0)
frame2

       YEA     STA  POP  DEB  eastern  Big state
01    2000    Ohio  1.5  NaN     True      False
02    2001    Ohio  1.7 -1.2     True      False
03    2002    Ohio  3.6  NaN     True       True
04    2001  Nevada  2.4 -1.5    False      False
five  2002  Nevada  2.9  NaN    False      False
six   2003  Nevada  3.2 -1.7    False      False

In [37]:
del frame2['Big state']
frame2.head()

       YEA     STA  POP  DEB  eastern
01    2000    Ohio  1.5  NaN     True
02    2001    Ohio  1.7 -1.2     True
03    2002    Ohio  3.6  NaN     True
04    2001  Nevada  2.4 -1.5    False
five  2002  Nevada  2.9  NaN    False

In [38]:
del frame2['eastern']
frame2.head()

       YEA     STA  POP  DEB
01    2000    Ohio  1.5  NaN
02    2001    Ohio  1.7 -1.2
03    2002    Ohio  3.6  NaN
04    2001  Nevada  2.4 -1.5
five  2002  Nevada  2.9  NaN

In [39]:
#중첩된 딕셔너리
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [40]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [41]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [42]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [46]:
print(frame3.iloc[0,0])
print(frame3.iloc[0,1])
print(frame3.iloc[1,0])
print(frame3.iloc[1,1])

2.4
1.7
2.9
3.6

In [50]:
frame3.iloc[0,[0,1]]

Nevada    2.4
Ohio      1.7
Name: 2001, dtype: float64

In [53]:
frame3.iloc[0:3,0:]

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [56]:
pdata = {'Ohio':frame3['Ohio'][:1],'Nevada':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   NaN     2.9

In [55]:
frame3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [59]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [60]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [61]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [62]:
df = titanic.iloc[;,['age','fare']]

SyntaxError: invalid syntax (<ipython-input-62-9cdf79f63f47>, line 1)

In [ ]:
print(type(df_add10))

In [ ]:
df_sub = df_add10 -df
df_sub

In [63]:
###################################색인

In [64]:
obj = pd.Series(range(3), index=['a','b','c'])
index = obj.index
print(index)
index[1:]

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

In [67]:
import numpy as np
import pandas as pd
labels = pd.Index(np.arange(3))
print(labels)
obj2 = pd.Series([1.5,-2.5,0], index=labels)
print(obj2)

Int64Index([0, 1, 2], dtype='int64')
0    1.5
1   -2.5
2    0.0
dtype: float64

In [68]:
obj2.index is labels

True

In [ ]:
###인덱스 중복 허용

In [70]:
dup_labels = pd.Index(['foo','foo','bar','bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [ ]:
####

In [100]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [104]:
obj2=obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [102]:
obj3 = pd.Series(['blue','purple','yellow'])
obj3

0      blue
1    purple
2    yellow
dtype: object

In [103]:
obj3.reindex(range(6), method='ffill')

0      blue
1    purple
2    yellow
3    yellow
4    yellow
5    yellow
dtype: object

In [78]:
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                        index=['a','c','d'],
                        columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [81]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [82]:
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [85]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [ ]:
### Serie에서의 drop

In [87]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [89]:
#여러개를 드롭 시킬때
new_obj2 = obj.drop(['d','c'])
new_obj2

a    0.0
b    1.0
e    4.0
dtype: float64

In [ ]:
## DataFrame에서의 drop

In [108]:
import pandas as pd
data = pd.DataFrame(np.arange(16).reshape((4,4)),index = ['Ohio','Colorado','Utah','New York'], columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [109]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [110]:
data2 = data.drop('two', axis=1) #axis=1행을 삭제
data2.drop('Utah', axis=0)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
New York   12     14    15

In [113]:
data.drop('Ohio',axis='rows') #axis='rows' or axis=0은 생략가능

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
### inplace

In [112]:
data3 = data.copy()
data3.drop('Ohio', inplace=True) #inplace를 사용하면 강제로 업데이트를 시킨다.
data3

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 인덱싱, Selection and filtering

In [115]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [118]:
print(obj['b'],obj[1]) ; print()
print(obj[2:4]); print()
print(obj[['b','a','d']]); print()
print(obj[[1,3]]); print()
print(obj<2)

1.0 1.0

c    2.0
d    3.0
dtype: float64

b    1.0
a    0.0
d    3.0
dtype: float64

b    1.0
d    3.0
dtype: float64

a     True
b     True
c    False
d    False
dtype: bool

In [119]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [121]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [122]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [125]:
data[['three','four']]

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [123]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [124]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [127]:
data[data<5] = 0 #data가 5보다 작은 것은 0을 대입하라
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [128]:
data.loc['Colorado',['two','three']] #colorado의 two, three 정보

two      5
three    6
Name: Colorado, dtype: int32

In [129]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [130]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [131]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [136]:
data.iloc[:,:,3][data.three>5]

IndexingError: Too many indexers

In [137]:
##################

In [138]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [139]:
print(ser[:1])
print(ser.loc[:1]) #
print(ser.iloc[:1]) #

0    0.0
dtype: float64
0    0.0
1    1.0
dtype: float64
0    0.0
dtype: float64

In [140]:
###################

In [142]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.978157  0.324542 -0.284169
Ohio   -1.645879 -1.719890 -0.453805
Texas   0.061151 -1.186651 -0.399978
Oregon -0.167135 -1.178070  0.645182

In [143]:
#절대값으로
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame
np.abs(frame)

               b         d         e
Utah    0.625913  0.163663  1.485966
Ohio    0.903782  0.334194  0.420946
Texas   0.717306  0.666660  0.003043
Oregon  0.751633  2.144100  0.748856

In [ ]:
# 가우시안 정규분포
#- np.random.randn : 평균 0 표준편차가 1인 가우시안 정규분포 난수 matrix 생성

In [144]:
f = lambda x:x.max()-x.min()
frame.apply(f)

b    0.277869
d    2.810761
e    1.489009
dtype: float64

In [146]:
frame.apply(f,axis='columns')

Utah      1.322304
Ohio      0.569588
Texas     1.383966
Oregon    1.395245
dtype: float64

In [150]:
import pandas as pd
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])
frame.apply(f)

            b        d         e
min  0.625913 -0.66666 -0.003043
max  0.903782  2.14410  1.485966

In [ ]:
###########sort

In [151]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [ ]:
# index를 기준으로 sording

In [152]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [153]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [154]:
frame.sort_index() #행을 오름차순으로 정렬

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [156]:
frame.sort_index(axis=1) #열을 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [159]:
frame.sort_index(axis='columns') #열을 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [161]:
frame.sort_index(axis='columns',ascending=False) #열을 역순으로 정렬

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [162]:
frame.sort_index(axis='columns',ascending=True) #열을 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [164]:
obj = pd.Series([4, 7, -3, 2])

In [166]:
obj.sort_values() #값이 낮은 기준으로 정렬

2   -3
3    2
0    4
1    7
dtype: int64

In [168]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [170]:
frame.sort_values(by='b') #b를 기준으로 정렬

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [172]:
frame.sort_values(by=['a','b']) #a기준으로, 그 다음 b를 기준으로

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [174]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [175]:
obj.rank()  # 중복된 숫자 4, 7이 두개 있기 때문에, 4.5등, 6.5등으로 표시했다. 4등인지 5등인지 알수 없기 때문에.

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [177]:
obj.rank(method='first') #중복 없이 먼저 있는 숫자가 우선.

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [178]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [ ]:
#

In [179]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [180]:
frame.rank(axis='columns') #한 행에 있는 열 값을 기준으로 순서 매김

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [181]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [183]:
obj.index.is_unique

False

In [184]:
obj['a']

a    0
a    1
dtype: int64

In [185]:
obj['c']

4

In [186]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  1.992441 -0.407913  0.086997
a -1.054706  1.244052 -0.476839
b -0.926747  0.672607  0.495337
b  0.292221 -2.447680  0.616745

In [187]:
df.loc['b']

          0         1         2
b -0.926747  0.672607  0.495337
b  0.292221 -2.447680  0.616745

In [188]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [190]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [192]:
df.sum(axis='columns') # columns별로

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [193]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [197]:
df.idmax()

AttributeError: 'DataFrame' object has no attribute 'idmax'

In [195]:
df.cumsum() #누계

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [196]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

### Unique Values, Value Counts, and Membership

In [198]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [200]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [201]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [202]:
pd.value_counts(obj.values, sort=False)

b    2
d    1
a    3
c    3
dtype: int64

In [ ]:
####

In [203]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [205]:
mask = obj.isin(['b','c']) #b,또는 c가 있는가?

In [206]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [ ]:
###

In [207]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [208]:
unique_vals = pd.Series(['c', 'b', 'a'])
unique_vals

0    c
1    b
2    a
dtype: object

In [209]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [210]:
####

In [212]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [213]:
result = data.apply(pd.value_counts).fillna(0)
result # 각 열마다 같은 것이 몇번 카운트 되었는지 알아본다

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [ ]:
# isin : Series의 각 원소가 넘겨받은 연속된 값에 속하는지 나타내는 bool배열을 반환
# match : 각 값에 대해 유일한 값을 담고 있는 배열에서의 정수 색인을 계산
# unique : Series에서 중복되는 값을 제거하고 유일한 값만 포함하는 배열을 반환
# value_count : Series에서 유일한 값에 대한 색인과 두수를 계산 (도수는 내림차순)

In [ ]:
order_id : 주문번호
quantity : 아이템의 주문수량
item_name : 아이템 이름
choice_description : 주문아이템 상세 선택 옵션
item_price : 주문아이템의 가격

1. 가장많이 주문한 아이템 top 10
2. 가장 비싼 아이템 총 몇개 팔렸을까?
3. Veggie Salad Bawl 이 몇 번 주문되었을까?

In [2]:

from PyQt5 import QtWidgets, uic, QtGui

import sys

import cv2

import numpy as np



class Ui(QtWidgets.QDialog):

    def __init__(self):

        super(Ui, self).__init__()

        uic.loadUi('C:/Users/w/python_test/gui/test5.ui', self)



        self.loadBtn = self.findChild(QtWidgets.QPushButton, 'loadBtn')

        self.loadBtn.clicked.connect(self.loadBtnClicked) 



        self.procRun = self.findChild(QtWidgets.QPushButton, 'procRun')

        self.procRun.clicked.connect(self.procRunClicked) 

        self.photo = self.findChild(QtWidgets.QLabel, 'photo')     

        self.photo.setPixmap(QtGui.QPixmap("images/pawns.jpg"))

        self.photo.setScaledContents(True)

        self.result = self.findChild(QtWidgets.QLabel, 'result')     

        self.fnameEdit = self.findChild(QtWidgets.QLineEdit,'fnameEdit')

        self.fnameEdit.clear()



        self.thr_hSlider = self.findChild(QtWidgets.QSlider, 'thr_hSlider')

        self.thr_hSlider.valueChanged.connect(self.thr_hSliderChanged)

        self.show()



    def thr_hSliderChanged(self):              

        self.thr_hSlider.setTickPosition(QtWidgets.QSlider.TicksBelow)

        self.thr_hSlider.setTickInterval(20)



        print(self.thr_hSlider.value())



    def processingImage(self, grayImage, colorImage):

        filter_contours=[]

        cImg = np.copy(colorImage)

        # gray이미지를 처리한다.

        ret, binary = cv2.threshold(grayImage,85,255,0)

        contours,hierachy = cv2.findContours(binary, cv2.RETR_TREE, \

                                                    cv2.CHAIN_APPROX_NONE)

        for i in range(len(contours)):

            contours_area = cv2.contourArea(contours[i])

            if contours_area > 5000.0 :

                if contours_area > 14500:

                    cv2.drawContours(cImg,[contours[i]],0,(0,255,0),2)

                else :

                    cv2.drawContours(cImg,[contours[i]],0,(0,0,255),2)

                cv2.putText(cImg, str(i), tuple(contours[i][0][0]), 

                                            cv2.FONT_HERSHEY_COMPLEX, \

                                            0.8, (0, 255, 0), 1)

                filter_contours.append(contours[i]) 

            # area = cv2.contourArea(contours[i])

            print(i," : ",contours_area)



        cv2.imshow('out',cv2.pyrDown(cImg))                

        

        #이미지를 잘라서 출력하려고 할때 다음과 같이 사용한다.

        # outImage = np.copy(grayImage[100:500,100:500])

        cImg = cv2.cvtColor(cImg,cv2.COLOR_BGR2RGB)

        return cImg



    def displayOutputImage(self, outImage):

        img_info = outImage.shape

        if outImage.ndim == 2 :

            qImg = QtGui.QImage(outImage, img_info[1], img_info[0], img_info[1]*1, QtGui.QImage.Format_Grayscale8)

        else :

            qImg = QtGui.QImage(outImage, img_info[1], img_info[0], img_info[1]*img_info[2], QtGui.QImage.Format_RGB888)

        pixmap = QtGui.QPixmap.fromImage(qImg)

        self.result.setPixmap(pixmap)

        self.result.setScaledContents(True)



    #cv2.imread가 한글 지원하지 않으므로 새로운 방식으로 파일 조합

    def imread(self, filename, flags=cv2.IMREAD_COLOR, dtype=np.uint8): 

        try: 

            n = np.fromfile(filename, dtype) 

            img = cv2.imdecode(n, flags) 

            return img 

        except Exception as e: 

            print(e) 

            return None



    def procRunClicked(self):

        src = self.imread(self.filename) #cv2.imread가 한글경로를 지원하지 않음

        imgRGB = cv2.cvtColor(src, cv2.COLOR_BGR2RGB)
        imgGRAY = cv2.cvtColor(src, cv2.COLOR_BGR2GRAY)
        outImg = self.processingImage(imgGRAY, imgRGB)        
        self.displayOutputImage(outImg)
        

    def loadBtnClicked(self):

        path = 'C:/Users/USER1/Downloads/1번 PCB 긁힘 - 불+양'

        # path = 'images'

        filter = "All Images(*.jpg; *.png; *.bmp);;JPG (*.jpg);;PNG(*.png);;BMP(*.bmp)"

        fname = QtWidgets.QFileDialog.getOpenFileName(self, "파일로드", path, filter)

        self.filename = str(fname[0])

        self.fnameEdit.setText(self.filename)

        self.photo.setPixmap(QtGui.QPixmap(self.filename))

        self.photo.setScaledContents(True)

app = QtWidgets.QApplication(sys.argv)
window = Ui()
app.exec_()